//
//  LevelModel.swift
//  witchie
//
//  Created by ditthales on 20/07/23.
//

import SwiftUI

struct LevelModel{
    
    //the width of a line
    var levelOffset: Int
    
    // the dialogue after completing a level
    var levelDialogue: String
    
    //map
    var levelMap: [String]
    
    
    
}

extension LevelModel{
    
    static func getLevels(chapter:Int) -> [LevelModel]{
        if chapter == 1{
            return patchOne()
        }else if chapter == 2{
            return patchTwo()
        }
        return []
    }
    
    static func patchOne() -> [LevelModel]{
        return[
            // LEVEL 1
            LevelModel(
                levelOffset: 7,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_1,
                levelMap: [
                    
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = gra≠ss,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    //Onboarding
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫",
                    "⬛️", "🙋🏿", "⬛️", "⬜️", "⬜️", "⬛️", "🟫",
                    "⬛️", "⬜️", "⬛️", "📦", "⬜️", "⬛️", "🟫",
                    "⬛️", "⬜️", "⬛️", "🔯", "⬜️", "⬛️", "🟫",
                    "⬛️", "📦", "⬛️", "⬛️", "⬜️", "⬛️", "🟫",
                    "⬛️", "⬜️", "⬜️", "⬛️", "⬜️", "⬛️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "📦", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 2
            LevelModel(
                levelOffset: 9,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_2,
                levelMap: [
                    
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "📦", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "📦", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️", "⬛️",
                    "⬛️", "⬛️", "⬜️", "⬜️", "📦", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "📦", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "🙋🏿", "🔯", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 3
            LevelModel(
                levelOffset: 8,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_3,
                levelMap: [
                    
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate.
                    
                    "🟫", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫",
                    "⬛️", "⬛️", "⬜️", "📦", "⬜️", "🔯", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬛️", "⬛️", "⬛️", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬛️", "⬛️", "🟫", "⬛️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬛️", "🟫", "🟫", "⬛️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬛️", "⬛️", "⬛️", "⬛️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "🔯", "⬜️", "📦", "🙋🏿", "⬜️", "⬛️",
                    "🟫", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️"
                    
                ]
            ),
            // LEVEL 4
            LevelModel(
                levelOffset: 8,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_4,
                levelMap: [
                    
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate.
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫",
                    "⬛️", "🔯", "📦", "⬜️", "⬜️", "⬜️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "🔯", "⬜️", "⬜️", "📦", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬛️", "⬛️",
                    "⬛️", "🔯", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "🙋🏿", "⬛️",
                    "🟫", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️"
                    
                ]
            ),
            // LEVEL 5
            LevelModel(
                levelOffset: 8,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_5,
                levelMap: [
                    
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate.
                    //Onboarding
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫",
                    "⬛️", "🔯", "⬜️", "📦", "⬜️", "🔯", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "🙋🏿", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "🔯", "📦", "⬜️", "⬜️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 6
            LevelModel(
                levelOffset: 9,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_6,
                levelMap: [
                    
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "🔯", "📦", "⬜️", "⬜️", "⬜️", "📦", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "🔯", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "🔯", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "🔯", "📦", "⬜️", "⬜️", "⬜️", "📦", "⬛️",
                    "⬛️", "🙋🏿", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 7
            LevelModel(
                levelOffset: 9,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_7,
                levelMap: [
                    
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "🔯", "⬜️", "📦", "⬜️", "📦", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "🔯", "⬜️", "⬜️", "⬜️", "🔯", "⬜️", "⬛️",
                    "⬛️", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "📦", "🔯", "⬜️", "🔯", "📦", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "🙋🏿", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 8
            LevelModel(
                levelOffset: 8,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_8,
                levelMap: [
                    
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate.
                    
                    //nivel médio
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "🔯", "⬛️", "🔯", "⬜️", "⬛️",
                    "⬛️", "📦", "⬜️", "📦", "⬜️", "📦", "⬜️", "⬛️",
                    "⬛️", "🔯", "🙋🏿", "⬜️", "⬜️", "⬜️", "📦", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬜️", "⬛️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬛️",
                    "⬛️", "📦", "⬜️", "📦", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "🔯", "⬛️", "⬛️", "📦", "📦", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "🔯", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫", "🟫"
                    
                ]
            ),
            // LEVEL 9
            LevelModel(
                levelOffset: 9,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_9,
                levelMap: [
                    
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬜️", "📦", "🙋🏿", "📦", "⬜️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 10
            LevelModel(
                levelOffset: 8,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_10,
                levelMap: [
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate.
                    //nivel que barreto VAI CHORAR
                    "🟫", "🟫", "🟫", "🟫", "🟫", "⬛️", "⬛️", "⬛️",
                    "🟫", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬛️",
                    "⬛️", "🙋🏿", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "📦", "📦", "📦", "📦", "📦", "📦", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "🔯", "🔯", "🔯", "🔯", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️"
                    
                ]
            ),
            // LEVEL 11
            LevelModel(
                levelOffset: 9,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_11,
                levelMap: [
                    
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate.
                    //Onboarding
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "🙋🏿", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 12
            LevelModel(
                levelOffset: 8,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_12,
                levelMap: [
                    
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate.
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫",
                    "⬛️", "🔯", "⬜️", "📦", "⬜️", "⬜️", "⬛️", "⬛️",
                    "⬛️", "🔯", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "🙋🏿", "⬛️", "⬛️",
                    "🟫", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫"     
                    
                ]
            ),
            // LEVEL 13
            LevelModel(
                levelOffset: 8,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_13,
                levelMap: [
                    
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "📦", "⬛️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "🙋🏿", "⬜️", "📦", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬜️", "⬛️", "⬛️", "⬜️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬛️", "⬛️", "⬜️", "🔯", "⬛️",
                    "⬛️", "🔯", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "📦", "⬜️", "📦", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️"
                    
                ]
            ),
            // LEVEL 14
            LevelModel(
                levelOffset: 9,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_14,
                levelMap: [
                    
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate.
                    //Onboarding
                    "⬛️", "⬛️", "⬛️", "⬛️", "🟫", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬛️", "⬛️", "⬛️", "🔯", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "📦", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "📦", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬛️", "⬜️", "🙋🏿", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "📦", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "📦", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "🔯", "⬛️", "⬛️", "⬛️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "🟫", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 15
            LevelModel(
                levelOffset: 8,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_15,
                levelMap: [
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "🔯", "⬛️", "🔯", "⬛️", "⬛️", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬛️", "⬜️", "⬛️", "⬛️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬛️", "⬜️", "⬛️", "⬛️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬛️",
                    "⬛️", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "⬛️",
                    "⬛️", "⬜️", "⬛️", "⬛️", "📦", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬛️", "⬛️", "⬜️", "⬜️", "🙋🏿", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️"
                    
                ]
            ),
            // LEVEL 16
            LevelModel(
                levelOffset: 9,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_16,
                levelMap: [
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "🙋🏿", "⬜️", "📦", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "📦", "⬜️", "📦", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "🔯", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️"
                    
                ]
            ),
            //FASE 17
            LevelModel(
                levelOffset: 9,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_17,
                levelMap: [
                    
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate.
                    //Onboarding
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫", "🟫", "🟫",
                    "⬛️", "🔯", "⬜️", "🔯", "🔯", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬛️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬜️", "⬛️", "⬛️", "⬛️", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "🙋🏿", "⬛️",
                    "⬛️", "⬛️", "⬛️", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "📦", "⬜️", "📦", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫", "🟫", "🟫", "🟫",
                    
                ]
            ),
            // FASE 18
            LevelModel(
                levelOffset: 9,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_18,
                levelMap: [
                    
                    "🟫", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬛️", "🔯", "🔯", "🔯", "🔯", "🔯", "🔯", "⬛️",
                    "⬛️", "🔯", "📦", "📦", "📦", "📦", "📦", "📦", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "⬜️", "⬜️", "📦", "🙋🏿", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫"
                    
                ]
            ),
            // FASE 19
            LevelModel(
                levelOffset: 9,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_19,
                levelMap: [
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "🔯", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬛️", "⬜️", "📦", "⬜️", "⬛️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "📦", "⬜️", "⬛️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "🙋🏿", "⬜️", "📦", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬛️", "⬜️", "📦", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬛️", "⬜️", "📦", "⬜️", "⬛️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "🔯", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️"
                    
                ]
            ),
            // FASE 20
            LevelModel(
                levelOffset: 10,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_20,
                levelMap: [
                    
                    "🟫", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫", "🟫",
                    "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "📦", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "📦", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "📦", "⬛️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "🙋🏿", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️", "🔯", "⬜️", "⬜️", "⬛️",
                    "🟫", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️"
                    
                ]
            ),
            // FASE 21
            LevelModel(
                levelOffset: 8,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_21,
                levelMap: [
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "🔯", "📦", "🙋🏿", "📦", "⬜️", "🔯", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "📦", "⬜️", "🔯", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "📦", "⬜️", "🔯", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "📦", "⬜️", "🔯", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "📦", "⬜️", "🔯", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "📦", "⬜️", "🔯", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "📦", "⬜️", "🔯", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "📦", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️"
                    
                ]
            ),
        ]
    }
    
    static func patchTwo() -> [LevelModel]{
        return[
            // LEVEL 1
            LevelModel(
                levelOffset: 7,
                levelDialogue: "Entendeu como funcionam os arbustos? Assim com você, eles não servem só para decoração.",
                levelMap: [
                    
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    //Onboarding
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫", "🟫",
                    "⬛️", "🙋🏿", "⬜️", "⬜️", "⬛️", "🟫", "🟫",
                    "⬛️", "⬛️", "⬜️", "🗄️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "⬛️", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬜️", "⬜️", "⬛️", "📦", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬜️", "⬛️", "⬛️", "⬛️",
                    "🟫", "🟫", "⬛️", "⬛️", "⬛️", "🟫", "🟫",
                    
                ]
            ),
            // LEVEL 2
            LevelModel(
                levelOffset: 7,
                levelDialogue: "Ok, talvez eu tenha exagerado na quantidade de arbustos. Cuidado pra não se perder por aí.",
                levelMap: [
                    
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    //Onboarding
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "🗄️", "🔯", "🗄️", "⬜️", "⬛️",
                    "⬛️", "🗄️", "⬜️", "📦", "⬜️", "🗄️", "⬛️",
                    "⬛️", "⬜️", "🗄️", "⬜️", "🗄️", "⬜️", "⬛️",
                    "⬛️", "🗄️", "⬜️", "🗄️", "⬜️", "🗄️", "⬛️",
                    "⬛️", "⬜️", "🗄️", "⬜️", "🗄️", "⬜️", "⬛️",
                    "⬛️", "🗄️", "⬜️", "🗄️", "⬜️", "🗄️", "⬛️",
                    "⬛️", "⬜️", "🗄️", "🙋🏿", "🗄️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 3
            LevelModel(
                levelOffset: 9,
                levelDialogue: "O cenário mudou, mas algumas coisas nunca mudam. Nem todas as jogadas são tão diretas ao ponto assim, lembre de pensar um pouco mais.",
                levelMap: [
                    
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    //Onboarding
                    "🟫", "🟫", "🟫", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "🟫", "🟫", "⬛️", "⬛️", "🔯", "⬛️", "🔯", "⬜️", "⬛️",
                    "🟫", "⬛️", "⬛️", "⬜️", "📦", "⬜️", "📦", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "🗄️", "🙋🏿", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "⬛️", "🔯", "⬛️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "🟫", "⬛️", "⬛️", "⬜️", "📦", "⬜️", "📦", "⬛️", "⬛️",
                    "🟫", "🟫", "⬛️", "⬜️", "🔯", "⬜️", "🔯", "⬛️", "🟫",
                    "🟫", "🟫", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫",
                    
                ]
            ),
            // LEVEL 4
            LevelModel(
                levelOffset: 9,
                levelDialogue: "Esqueceu de tudo que aprendeu lá em casa, né? Fique atento que aqui vai precisar também!",
                levelMap: [
                    
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🗄️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🙋🏿", "🗄️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 5
            LevelModel(
                levelOffset: 9,
                levelDialogue: "Essa planta é o equivalente à um peixe beta, ela não tolera outras plantas, por isso ela está solitária.",
                levelMap: [
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "🗄️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "📦", "⬜️", "🗄️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "🗄️", "⬜️", "🗄️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "🗄️", "⬜️", "🗄️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "🗄️", "🙋🏿", "🗄️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "🗄️", "⬜️", "🗄️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "🗄️", "⬜️", "🗄️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "🗄️", "🗄️", "🗄️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "🗄️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "🗄️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 6
            LevelModel(
                levelOffset: 9,
                levelDialogue: "Toma cuidado na hora de empurrar os arbustos, às vezes atrapalha mais do que ajuda.",
                levelMap: [
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "🗄️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "🗄️", "⬛️", "⬜️", "🗄️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "🗄️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🙋🏿", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🗄️", "⬜️", "🗄️", "⬜️", "⬛️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "📦", "⬜️", "⬛️",
                    "⬛️", "⬜️", "🗄️", "⬜️", "⬛️", "⬜️", "🗄️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 7
            LevelModel(
                levelOffset: 9,
                levelDialogue: "Você começou bem, mas agora tá desacelerando. Seria uma metáfora da vida?",
                levelMap: [
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "🔯", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "📦", "📦", "📦", "📦", "📦", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬜️", "⬜️", "🙋🏿", "⬜️", "⬜️", "⬛️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "🗄️", "🗄️", "🗄️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "🗄️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 8
            LevelModel(
                levelOffset: 15,
                levelDialogue: "Minhas plantas estavam ansiosas pra te conhecer, mas aparentemente sua performance no capítulo anterior nos deu falsas esperanças. Uma pena.",
                levelMap: [
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️", "🟫",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "🟫",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬛️", "🟫",
                    "⬛️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "🟫",
                    "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️", "🟫",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🗄️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "🟫",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬛️", "🟫",
                    "⬛️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🙋🏿", "⬛️", "🟫",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫",
                    
                ]
            ),
            // LEVEL 9
            LevelModel(
                levelOffset: 10,
                levelDialogue: "Um jardim dentro de um jardim, talvez eu tenha me inspirado em um filme famoso... Sabe qual é ou você só é mais um sem cultura?",
                levelMap: [
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "🟫", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬜️", "🗄️", "⬜️", "⬛️", "🗄️", "🗄️", "⬜️", "⬛️",
                    "⬛️", "🙋🏿", "📦", "⬜️", "📦", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬜️", "🗄️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "🟫", "⬛️", "🔯", "⬜️", "🔯", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "🟫", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 10
            LevelModel(
                levelOffset: 11,
                levelDialogue: "Começou cercado, né? Se acostuma que a vida é assim!",
                levelMap: [
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "🔯", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "📦", "🗄️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "🗄️", "🙋🏿", "🗄️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "📦", "🗄️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "🔯", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 11
            LevelModel(
                levelOffset: 9,
                levelDialogue: "Se tu só ficar empurrando sem pensar, nunca vai conseguir passar logo das fases...",
                levelMap: [
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "🔯", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "📦", "🗄️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "🗄️", "⬜️", "🗄️", "⬜️", "🗄️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "📦", "🗄️", "⬜️", "🗄️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "🗄️", "⬜️", "🙋🏿", "⬜️", "🗄️", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "🗄️", "⬜️", "🗄️", "📦", "⬜️", "⬛️",
                    "⬛️", "⬜️", "🗄️", "⬜️", "🗄️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "🗄️", "📦", "🗄️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "🔯", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 12
            LevelModel(
                levelOffset: 9,
                levelDialogue: "Empurra pra um lado, empurra pro outro... nada de novo sob o sol!",
                levelMap: [
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "🔯", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "📦", "🔯", "📦", "🔯", "📦", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "🗄️", "⬜️", "🗄️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "📦", "⬜️", "🗄️", "⬜️", "📦", "⬜️", "⬛️",
                    "⬛️", "⬜️", "🔯", "⬜️", "🙋🏿", "⬜️", "🔯", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 13
            LevelModel(
                levelOffset: 11,
                levelDialogue: "Meus jardins são cheios de belos corredores, olha que sorte a sua ter a honra de trabalhar neles!",
                levelMap: [
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "🔯", "⬛️", "🔯", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬛️", "🔯", "⬜️", "🗄️", "⬜️", "📦", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬛️", "🔯", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬜️", "🗄️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬜️", "🗄️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬛️", "🔯", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬛️", "🔯", "⬜️", "🗄️", "⬜️", "📦", "⬜️", "🗄️", "⬛️",
                    "⬛️", "🔯", "⬛️", "🔯", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "🙋🏿", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 14
            LevelModel(
                levelOffset: 13,
                levelDialogue: "Assim como nós, bruxas, as melhores plantas florescem sob pressão.",
                levelMap: [
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    
                    "🟫", "🟫", "🟫", "🟫", "🟫", "🟫", "🟫", "⬛️", "⬛️", "⬛️", "⬛️", "🟫", "🟫",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬜️", "⬜️", "⬛️", "⬛️", "🟫",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "🗄️", "🗄️", "🗄️", "⬜️", "⬜️", "🙋🏿", "⬛️", "⬛️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫", "🟫",
                    
                ]
            ),
            // LEVEL 15
            LevelModel(
                levelOffset: 13,
                levelDialogue: "Esse é um dos meus jardins favoritos. Ele é grande e majestososo, bem diferente de certas pessoas...",
                levelMap: [
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "⬜️", "⬜️", "🗄️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬛️", "⬛️", "⬛️", "⬜️", "⬛️", "⬛️", "⬛️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🗄️", "⬜️", "⬜️", "⬜️", "⬜️", "🙋🏿", "⬜️", "⬜️", "⬜️", "⬜️", "🗄️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬛️", "⬛️", "⬛️", "⬜️", "⬛️", "⬛️", "⬛️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "⬜️", "⬜️", "🗄️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 16
            LevelModel(
                levelOffset: 13,
                levelDialogue: "Eu fiz esse jardim em homenagem à um jogo que eu adorava na infância. Inclusive, saudades dela, quando não existiam boletos pra pagar",
                levelMap: [
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🗄️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "📦", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬜️", "📦", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬜️", "⬜️", "📦", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "🔯", "⬜️", "🔯", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬜️", "⬜️", "📦", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬜️", "📦", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "📦", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🗄️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🗄️", "🙋🏿", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 17
            LevelModel(
                levelOffset: 13,
                levelDialogue: "As plantas estão brotando como se fossem feijões mágicos! Talvez você também possa aprender uma coisa ou duas com elas.",
                levelMap: [
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬜️", "⬜️", "⬜️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "🗄️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "🗄️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🙋🏿", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 18
            LevelModel(
                levelOffset: 11,
                levelDialogue: "Notei que você está empurrando esses arbustos como se eles fossem seus sonhos: com força, mas sem esperança.",
                levelMap: [
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "🔯", "⬜️", "🙋🏿", "⬜️", "🔯", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "🗄️", "🗄️", "🗄️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "🗄️", "⬜️", "⬜️", "⬜️", "🗄️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "⬜️", "🔯", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 19
            LevelModel(
                levelOffset: 11,
                levelDialogue: "Até as abóboras se transformam em carruagens com mais facilidade do que você coloca as plantas no lugar.",
                levelMap: [
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    
                    "🟫", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫", "🟫", "🟫",
                    "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬛️", "⬛️", "🟫",
                    "⬛️", "⬜️", "⬜️", "⬜️", "📦", "📦", "⬜️", "⬜️", "⬜️", "⬛️", "🟫",
                    "⬛️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "📦", "⬜️", "🗄️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "🗄️", "🙋🏿", "🗄️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "🗄️", "⬜️", "🔯", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬜️", "⬜️", "⬛️",
                    "🟫", "⬛️", "⬜️", "⬜️", "⬜️", "🔯", "🔯", "⬜️", "⬜️", "⬜️", "⬛️",
                    "🟫", "⬛️", "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "🟫", "🟫", "🟫", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 20
            LevelModel(
                levelOffset: 11,
                levelDialogue: "FINALMENTE ENCONTRAMOS A GERTRUDES!!! Tive que fazer um jardim especial para minha plantinha especial.",
                levelMap: [
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "🗄️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🗄️", "🔯", "🗄️", "⬜️", "⬜️", "⬜️", "⬜️", "🙋🏿", "⬜️", "⬛️",
                    "⬛️", "⬜️", "🗄️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "🗄️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "📦", "⬜️", "🗄️", "🔯", "🗄️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "📦", "⬜️", "⬜️", "🗄️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🗄️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🗄️", "🔯", "🗄️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🗄️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 21
            LevelModel(
                levelOffset: 11,
                levelDialogue: "Finalmente o jardim está florido novamente, e a Gertrudes está mais linda do que nunca! E conseguimos terminar logo antes da época mais especial do ano...",
                levelMap: [
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "⬛️", "⬛️", "⬛️", "⬜️", "⬜️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "🗄️", "⬜️", "🔯", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬛️",
                    "⬛️", "⬜️", "🗄️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "🙋🏿", "⬛️",
                    "⬛️", "⬜️", "🗄️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬛️",
                    "⬛️", "⬜️", "🗄️", "⬜️", "🔯", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "⬛️", "⬛️", "⬛️", "⬜️", "⬜️", "⬛️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
        ]
    }
    
    
    
    static func getIndexes(of element: String, in array: [String]) -> [Int] {
        var result = [Int]()
        for (index, value) in array.enumerated() {
            if value == element {
                result.append(index)
            }
        }
        return result
    }
}
