//
//  LevelModel.swift
//  witchie
//
//  Created by ditthales on 20/07/23.
//

import SwiftUI

struct LevelModel{
    
    //the width of a line
    var levelOffset: Int
    
    // the dialogue after completing a level
    var levelDialogue: String
    
    //map
    var levelMap: [String]
    
}

extension LevelModel{
    static func patchOne() -> [LevelModel]{
        return[
            // LEVEL 1
            LevelModel(
                levelOffset: 7,
                levelDialogue: "Caramba olha como você foi rápido! Tenho certeza que se continuar assim a Vassorilda volta ao normal rapidinho, vamo pra próxima sala?",
                levelMap: [
                    
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate.
                    //Onboarding
                     "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫",
                     "⬛️", "🙋🏿", "⬛️", "⬜️", "⬜️", "⬛️", "🟫",
                     "⬛️", "⬜️", "⬛️", "📦", "⬜️", "⬛️", "🟫",
                     "⬛️", "⬜️", "⬛️", "🔯", "⬜️", "⬛️", "🟫",
                     "⬛️", "📦", "⬛️", "⬛️", "⬜️", "⬛️", "🟫",
                     "⬛️", "⬜️", "⬜️", "⬛️", "⬜️", "⬛️", "⬛️",
                     "⬛️", "🔯", "⬜️", "⬜️", "📦", "🔯", "⬛️",
                     "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 2
            LevelModel(
                levelOffset: 9,
                levelDialogue: "Subindo e descendo a escadinha... Acho que encontrar os padrões é a chave!",
                levelMap: [
                    
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "📦", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "📦", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️", "⬛️",
                    "⬛️", "⬛️", "⬜️", "⬜️", "📦", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "📦", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "🙋🏿", "🔯", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 3
            LevelModel(
                levelOffset: 8,
                levelDialogue: "É… Não foi tão direto quanto antes mas até que você não foi mal, pronto pra seguir em frente?",
                levelMap: [
                    
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate.
                    
                    "🟫", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫",        //00 //01 //02 //03 //04 //05 //06 //07
                    "⬛️", "⬛️", "⬜️", "📦", "⬜️", "🔯", "⬛️", "⬛️",        //08 //09 //10 //11 //12 //13 //14 //15
                    "⬛️", "⬜️", "⬜️", "⬛️", "⬛️", "⬛️", "🔯", "⬛️",        //16 //17 //18 //19 //20 //21 //22 //23
                    "⬛️", "⬜️", "⬛️", "⬛️", "🟫", "⬛️", "⬜️", "⬛️",        //24 //25 //26 //27 //28 //29 //30 //31
                    "⬛️", "⬜️", "⬛️", "🟫", "🟫", "⬛️", "⬜️", "⬛️",        //32 //33 //34 //35 //36 //37 //38 //39
                    "⬛️", "⬜️", "⬛️", "⬛️", "⬛️", "⬛️", "⬜️", "⬛️",        //40 //41 //42 //43 //44 //45 //46 //47
                    "⬛️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬛️",        //48 //49 //50 //51 //52 //53 //54 //55
                    "⬛️", "🔯", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬛️",        //56 //57 //58 //59 //60 //61 //62 //63
                    "⬛️", "⬛️", "🔯", "⬜️", "📦", "🙋🏿", "⬜️", "⬛️",        //64 //65 //66 //67 //68 //69 //70 //71
                    "🟫", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️"         //72 //73 //74 //75 //76 //77 //78 //79
                    
                ]
            ),
            // LEVEL 4
            LevelModel(
                levelOffset: 8,
                levelDialogue: "Viu que era só parar e pensar invés de empurrar tudo de uma vez? A pressa é inimiga da perfeição!",
                levelMap: [
                    
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate.
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫",        //00 //01 //02 //03 //04 //05 //06 //07
                    "⬛️", "🔯", "📦", "⬜️", "⬜️", "⬜️", "⬛️", "⬛️",        //08 //09 //10 //11 //12 //13 //14 //15
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",        //16 //17 //18 //19 //20 //21 //22 //23
                    "⬛️", "⬛️", "⬛️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",        //24 //25 //26 //27 //28 //29 //30 //31
                    "⬛️", "⬛️", "⬛️", "🔯", "⬜️", "⬜️", "📦", "⬛️",        //32 //33 //34 //35 //36 //37 //38 //39
                    "⬛️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "🔯", "⬛️",        //40 //41 //42 //43 //44 //45 //46 //47
                    "⬛️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬛️", "⬛️",        //48 //49 //50 //51 //52 //53 //54 //55
                    "⬛️", "🔯", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",        //56 //57 //58 //59 //60 //61 //62 //63
                    "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "🙋🏿", "⬛️",        //64 //65 //66 //67 //68 //69 //70 //71
                    "🟫", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️"         //72 //73 //74 //75 //76 //77 //78 //79
                    
                ]
            ),
            // LEVEL 5
            LevelModel(
                levelOffset: 8,
                levelDialogue: "Parecia óbvio né? Pois ta aí a lição de nunca confiar em ninguém!!!",
                levelMap: [
                    
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate.
                    //Onboarding
                     "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫",
                     "⬛️", "🔯", "⬜️", "📦", "⬜️", "🔯", "⬛️", "⬛️",
                     "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬛️",
                     "⬛️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "🙋🏿", "⬛️",
                     "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬜️", "⬜️", "⬛️",
                     "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                     "⬛️", "⬜️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                     "⬛️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬛️",
                     "⬛️", "⬜️", "🔯", "📦", "⬜️", "⬜️", "⬛️", "⬛️",
                     "⬛️", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                     "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 6
            LevelModel(
                levelOffset: 9,
                levelDialogue: "Esquecesse de parar e pensar de novo né? E olhe que ainda tava simétrica pra deixar mais fácil.",
                levelMap: [
                    
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "🔯", "📦", "⬜️", "⬜️", "⬜️", "📦", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "🔯", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "🔯", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "🔯", "📦", "⬜️", "⬜️", "⬜️", "📦", "⬛️",
                    "⬛️", "🙋🏿", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 7
            LevelModel(
                levelOffset: 9,
                levelDialogue: "Eita como demora pra ouvir minhas dicas...",
                levelMap: [
                    
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "🔯", "⬜️", "📦", "⬜️", "📦", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "🔯", "⬜️", "⬜️", "⬜️", "🔯", "⬜️", "⬛️",
                    "⬛️", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "📦", "🔯", "⬜️", "🔯", "📦", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "🙋🏿", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 8
            LevelModel(
                levelOffset: 8,
                levelDialogue: "Olha não vem jogar a culpa em mim não, minha filha que insistiu pra eu chamar o namorado arquiteto dela porque ele tinha umas ideias “modernas” para as minhas salas… Qual o problema da velha e clássica teia de aranha?!?!",
                levelMap: [
                    
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate.
                    
                    //nivel médio
                     "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                     "⬛️", "⬜️", "⬜️", "🔯", "⬛️", "🔯", "⬜️", "⬛️",
                     "⬛️", "📦", "⬜️", "📦", "⬜️", "📦", "⬜️", "⬛️",
                     "⬛️", "🔯", "🙋🏿", "⬜️", "⬜️", "⬜️", "📦", "⬛️",
                     "⬛️", "⬛️", "⬛️", "⬜️", "⬛️", "⬜️", "🔯", "⬛️",
                     "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬛️",
                     "⬛️", "📦", "⬜️", "📦", "⬜️", "⬜️", "🔯", "⬛️",
                     "⬛️", "🔯", "⬛️", "⬛️", "📦", "📦", "🔯", "⬛️",
                     "⬛️", "⬛️", "⬛️", "⬛️", "🔯", "⬛️", "⬛️", "⬛️",
                     "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫", "🟫"

                ]
            ),
            // LEVEL 9
            LevelModel(
                levelOffset: 9,
                levelDialogue: "Não é porque parece simples que é! Fica sempre ligado que as paredes são suas amigas viu?",
                levelMap: [
                    
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬜️", "📦", "🙋🏿", "📦", "⬜️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 10
            LevelModel(
                levelOffset: 8,
                levelDialogue: "Esse padrão foi interessante, acho que vale a pena memorizar...",
                levelMap: [
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate.
                    //nivel que barreto VAI CHORAR
                    "🟫", "🟫", "🟫", "🟫", "🟫", "⬛️", "⬛️", "⬛️",
                    "🟫", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬛️",
                    "⬛️", "🙋🏿", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "📦", "📦", "📦", "📦", "📦", "📦", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "🔯", "🔯", "🔯", "🔯", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️"
                    
                ]
            ),
            // LEVEL 11
            LevelModel(
                levelOffset: 9,
                levelDialogue: "To começando a achar que botaram esses círculos em lugares complicadinhos de propósito...",
                levelMap: [
                    
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate.
                    //Onboarding
                     "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                     "⬛️", "🔯", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                     "⬛️", "⬛️", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                     "⬛️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "🔯", "⬛️",
                     "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬛️",
                     "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "🙋🏿", "⬛️",
                     "⬛️", "⬜️", "⬜️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                     "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️", "⬛️",
                     "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                     "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬛️",
                     "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 12
            LevelModel(
                levelOffset: 8,
                levelDialogue: "Meus parabéns viu? Essa ai era um divisor de águas, se chegasse até aqui talvez tenha algum futuro nesse trabalho…",
                levelMap: [
                    
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate.
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫",        //00 //01 //02 //03 //04 //05 //06 //07
                    "⬛️", "🔯", "⬜️", "📦", "⬜️", "⬜️", "⬛️", "⬛️",        //08 //09 //10 //11 //12 //13 //14 //15
                    "⬛️", "🔯", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",        //16 //17 //18 //19 //20 //21 //22 //23
                    "⬛️", "🔯", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",        //24 //25 //26 //27 //28 //29 //30 //31
                    "⬛️", "🔯", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",        //32 //33 //34 //35 //36 //37 //38 //39
                    "⬛️", "🔯", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",        //40 //41 //42 //43 //44 //45 //46 //47
                    "⬛️", "🔯", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",        //48 //49 //50 //51 //52 //53 //54 //55
                    "⬛️", "🔯", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",        //56 //57 //58 //59 //60 //61 //62 //63
                    "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "🙋🏿", "⬛️", "⬛️",        //64 //65 //66 //67 //68 //69 //70 //71
                    "🟫", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫"         //72 //73 //74 //75 //76 //77 //78 //79
                    
                ]
            ),
            // LEVEL 13
            LevelModel(
                levelOffset: 8,
                levelDialogue: "Eu nem sabia que tinha tanto caldeirão assim, ta bom de fazer um bazar.",
                levelMap: [
                    
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "📦", "⬛️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "🙋🏿", "⬜️", "📦", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬜️", "⬛️", "⬛️", "⬜️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬛️", "⬛️", "⬜️", "🔯", "⬛️",
                    "⬛️", "🔯", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "📦", "⬜️", "📦", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️"
                    
                ]
            ),
            // LEVEL 14
            LevelModel(
                levelOffset: 9,
                levelDialogue: "Eita quanta correria pra lá e pra cá, chega to tontinha!",
                levelMap: [
                    
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate.
                    //Onboarding
                     "⬛️", "⬛️", "⬛️", "⬛️", "🟫", "⬛️", "⬛️", "⬛️", "⬛️",
                     "⬛️", "🔯", "⬜️", "⬛️", "⬛️", "⬛️", "🔯", "🔯", "⬛️",
                     "⬛️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                     "⬛️", "📦", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "📦", "⬛️",
                     "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬛️",
                     "⬛️", "⬜️", "⬛️", "⬜️", "🙋🏿", "⬜️", "⬜️", "⬜️", "⬛️",
                     "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                     "⬛️", "📦", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "📦", "⬛️",
                     "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬛️",
                     "⬛️", "🔯", "🔯", "⬛️", "⬛️", "⬛️", "⬜️", "🔯", "⬛️",
                     "⬛️", "⬛️", "⬛️", "⬛️", "🟫", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 15
            LevelModel(
                levelOffset: 8,
                levelDialogue: "Eu acho que nunca vi ninguém apertar tanto aquele botão, deve tá até emperrado agora.",
                levelMap: [
                    
                    //nivel que barreto CHOROU
                     "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                     "⬛️", "🔯", "⬛️", "🔯", "⬛️", "⬛️", "🔯", "⬛️",
                     "⬛️", "⬜️", "⬛️", "⬜️", "⬛️", "⬛️", "⬜️", "⬛️",
                     "⬛️", "⬜️", "⬛️", "⬜️", "⬛️", "⬛️", "⬜️", "⬛️",
                     "⬛️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬛️",
                     "⬛️", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "⬛️",
                     "⬛️", "⬜️", "⬛️", "⬛️", "📦", "⬜️", "⬜️", "⬛️",
                     "⬛️", "⬜️", "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️",
                     "⬛️", "🔯", "⬛️", "⬛️", "⬜️", "⬜️", "🙋🏿", "⬛️",
                     "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️"
                    
                ]
            ),
            /*// FASE EXTRA
            LevelModel(
                levelOffset: 8,
                levelDialogue: "Colega isso nem tava na lista, como tu veio parar aqui??? E mais importante: POR QUE TU FICASSE ATÉ RESOLVER??? Vai dar um rolê",
                levelMap: [
                    
                    //nivel que barreto VAI CHORAR
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "🔯", "📦", "🙋🏿", "📦", "⬜️", "🔯", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "📦", "⬜️", "🔯", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "📦", "⬜️", "🔯", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "📦", "⬜️", "🔯", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "📦", "⬜️", "🔯", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "📦", "⬜️", "🔯", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "📦", "⬜️", "🔯", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "📦", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️"
                    
                ]
            ),*/
        ]
    }
    
    static func getIndexes(of element: String, in array: [String]) -> [Int] {
        var result = [Int]()
        for (index, value) in array.enumerated() {
            if value == element {
                result.append(index)
            }
        }
        return result
    }
}
