//
//  LevelModel.swift
//  witchie
//
//  Created by ditthales on 20/07/23.
//

import SwiftUI

struct LevelModel {
    
    //the width of a line
    var levelOffset: Int
    
    // the dialogue after completing a level
    var levelDialogue: String
    
    //map
    var levelMap: [String]
    
}

extension LevelModel{
    
    static func getLevels(chapter:Int) -> [LevelModel]{
        if chapter == 1{
            return patchOne()
        }else if chapter == 2{
            return patchTwo()
        }
        return []
    }
    
    static func patchOne() -> [LevelModel]{
        return[
            // LEVEL 1
            LevelModel(
                levelOffset: 7,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_1,
                levelMap: [
                    
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = gra≠ss,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    //Onboarding
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫",
                    "⬛️", "🙋🏿", "⬛️", "⬜️", "⬜️", "⬛️", "🟫",
                    "⬛️", "🗄️", "⬛️", "📦", "⬜️", "⬛️", "🟫",
                    "⬛️", "⬜️", "⬛️", "🔯", "⬜️", "⬛️", "🟫",
                    "⬛️", "⬜️", "⬛️", "⬛️", "⬜️", "⬛️", "🟫",
                    "⬛️", "⬜️", "⬜️", "⬛️", "⬜️", "⬛️", "⬛️",
                    "⬛️", "🕳️", "⬜️", "⬜️", "🗄️", "🕳️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 2
            LevelModel(
                levelOffset: 9,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_2,
                levelMap: [
                    
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "📦", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "📦", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️", "⬛️",
                    "⬛️", "⬛️", "⬜️", "⬜️", "📦", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "📦", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "🙋🏿", "🔯", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 3
            LevelModel(
                levelOffset: 8,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_3,
                levelMap: [
                    
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate.
                    
                    "🟫", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫",
                    "⬛️", "⬛️", "⬜️", "📦", "⬜️", "🔯", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬛️", "⬛️", "⬛️", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬛️", "⬛️", "🟫", "⬛️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬛️", "🟫", "🟫", "⬛️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬛️", "⬛️", "⬛️", "⬛️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "🔯", "⬜️", "📦", "🙋🏿", "⬜️", "⬛️",
                    "🟫", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️"
                    
                ]
            ),
            // LEVEL 4
            LevelModel(
                levelOffset: 8,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_4,
                levelMap: [
                    
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate.
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫",
                    "⬛️", "🔯", "📦", "⬜️", "⬜️", "⬜️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "🔯", "⬜️", "⬜️", "📦", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬛️", "⬛️",
                    "⬛️", "🔯", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "🙋🏿", "⬛️",
                    "🟫", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️"
                    
                ]
            ),
            // LEVEL 5
            LevelModel(
                levelOffset: 8,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_5,
                levelMap: [
                    
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate.
                    //Onboarding
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫",
                    "⬛️", "🔯", "⬜️", "📦", "⬜️", "🔯", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "🙋🏿", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "🔯", "📦", "⬜️", "⬜️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 6
            LevelModel(
                levelOffset: 9,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_6,
                levelMap: [
                    
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "🔯", "📦", "⬜️", "⬜️", "⬜️", "📦", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "🔯", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "🔯", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "🔯", "📦", "⬜️", "⬜️", "⬜️", "📦", "⬛️",
                    "⬛️", "🙋🏿", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 7
            LevelModel(
                levelOffset: 9,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_7,
                levelMap: [
                    
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "🔯", "⬜️", "📦", "⬜️", "📦", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "🔯", "⬜️", "⬜️", "⬜️", "🔯", "⬜️", "⬛️",
                    "⬛️", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "📦", "🔯", "⬜️", "🔯", "📦", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "🙋🏿", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 8
            LevelModel(
                levelOffset: 8,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_8,
                levelMap: [
                    
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate.
                    
                    //nivel médio
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "🔯", "⬛️", "🔯", "⬜️", "⬛️",
                    "⬛️", "📦", "⬜️", "📦", "⬜️", "📦", "⬜️", "⬛️",
                    "⬛️", "🔯", "🙋🏿", "⬜️", "⬜️", "⬜️", "📦", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬜️", "⬛️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬛️",
                    "⬛️", "📦", "⬜️", "📦", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "🔯", "⬛️", "⬛️", "📦", "📦", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "🔯", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫", "🟫"
                    
                ]
            ),
            // LEVEL 9
            LevelModel(
                levelOffset: 9,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_9,
                levelMap: [
                    
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬜️", "📦", "🙋🏿", "📦", "⬜️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 10
            LevelModel(
                levelOffset: 8,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_10,
                levelMap: [
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate.
                    //nivel que barreto VAI CHORAR
                    "🟫", "🟫", "🟫", "🟫", "🟫", "⬛️", "⬛️", "⬛️",
                    "🟫", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬛️",
                    "⬛️", "🙋🏿", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "📦", "📦", "📦", "📦", "📦", "📦", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "🔯", "🔯", "🔯", "🔯", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️"
                    
                ]
            ),
            // LEVEL 11
            LevelModel(
                levelOffset: 9,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_11,
                levelMap: [
                    
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate.
                    //Onboarding
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "🙋🏿", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 12
            LevelModel(
                levelOffset: 8,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_12,
                levelMap: [
                    
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate.
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫",
                    "⬛️", "🔯", "⬜️", "📦", "⬜️", "⬜️", "⬛️", "⬛️",
                    "⬛️", "🔯", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "🙋🏿", "⬛️", "⬛️",
                    "🟫", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫"     
                    
                ]
            ),
            // LEVEL 13
            LevelModel(
                levelOffset: 8,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_13,
                levelMap: [
                    
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "📦", "⬛️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "🙋🏿", "⬜️", "📦", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬜️", "⬛️", "⬛️", "⬜️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬛️", "⬛️", "⬜️", "🔯", "⬛️",
                    "⬛️", "🔯", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "📦", "⬜️", "📦", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️"
                    
                ]
            ),
            // LEVEL 14
            LevelModel(
                levelOffset: 9,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_14,
                levelMap: [
                    
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate.
                    //Onboarding
                    "⬛️", "⬛️", "⬛️", "⬛️", "🟫", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬛️", "⬛️", "⬛️", "🔯", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "📦", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "📦", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬛️", "⬜️", "🙋🏿", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "📦", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "📦", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "🔯", "⬛️", "⬛️", "⬛️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "🟫", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 15
            LevelModel(
                levelOffset: 8,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_15,
                levelMap: [
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "🔯", "⬛️", "🔯", "⬛️", "⬛️", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬛️", "⬜️", "⬛️", "⬛️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬛️", "⬜️", "⬛️", "⬛️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬛️",
                    "⬛️", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "⬛️",
                    "⬛️", "⬜️", "⬛️", "⬛️", "📦", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬛️", "⬛️", "⬜️", "⬜️", "🙋🏿", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️"
                    
                ]
            ),
            // LEVEL 16
            LevelModel(
                levelOffset: 9,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_16,
                levelMap: [
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "🙋🏿", "⬜️", "📦", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "📦", "⬜️", "📦", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "🔯", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️"
                    
                ]
            ),
            //FASE 17
            LevelModel(
                levelOffset: 9,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_17,
                levelMap: [
                    
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate.
                    //Onboarding
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫", "🟫", "🟫",
                    "⬛️", "🔯", "⬜️", "🔯", "🔯", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬛️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬜️", "⬛️", "⬛️", "⬛️", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "🙋🏿", "⬛️",
                    "⬛️", "⬛️", "⬛️", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "📦", "⬜️", "📦", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫", "🟫", "🟫", "🟫",
                    
                ]
            ),
            // FASE 18
            LevelModel(
                levelOffset: 9,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_18,
                levelMap: [
                    
                    "🟫", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬛️", "🔯", "🔯", "🔯", "🔯", "🔯", "🔯", "⬛️",
                    "⬛️", "🔯", "📦", "📦", "📦", "📦", "📦", "📦", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "⬜️", "⬜️", "📦", "🙋🏿", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫",
                    "🟫", "🟫", "🟫", "🟫", "🟫", "🟫", "🟫", "🟫", "🟫"
                    
                ]
            ),
            // FASE 19
            LevelModel(
                levelOffset: 9,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_19,
                levelMap: [
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "🔯", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬛️", "⬜️", "📦", "⬜️", "⬛️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "📦", "⬜️", "⬛️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "🙋🏿", "⬜️", "📦", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬛️", "⬜️", "📦", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬛️", "⬜️", "📦", "⬜️", "⬛️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "🔯", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️"
                    
                ]
            ),
            // FASE 20
            LevelModel(
                levelOffset: 10,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_20,
                levelMap: [
                    
                    "🟫", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫", "🟫",
                    "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "📦", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "📦", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "📦", "⬛️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "🙋🏿", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️", "🔯", "⬜️", "⬜️", "⬛️",
                    "🟫", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️"
                    
                ]
            ),
            // FASE 21
            LevelModel(
                levelOffset: 8,
                levelDialogue: ContentComponent.LEVEL_DIALOGUE_21,
                levelMap: [
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "🔯", "📦", "🙋🏿", "📦", "⬜️", "🔯", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "📦", "⬜️", "🔯", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "📦", "⬜️", "🔯", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "📦", "⬜️", "🔯", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "📦", "⬜️", "🔯", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "📦", "⬜️", "🔯", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "📦", "⬜️", "🔯", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "📦", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "🟫", "🟫", "🟫", "🟫", "🟫", "🟫", "🟫", "🟫"
                    
                ]
            ),
        ]
    }
    
    static func patchTwo() -> [LevelModel]{
        return[
            // LEVEL 1
            LevelModel(
                levelOffset: 7,
                levelDialogue: ContentComponent.CHAPTER2_LEVEL_DIALOGUE_1,
                levelMap: [
                    
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    //Onboarding
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫", "🟫",
                    "⬛️", "🙋🏿", "⬜️", "⬜️", "⬛️", "🟫", "🟫",
                    "⬛️", "⬛️", "⬜️", "🗄️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "⬛️", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬜️", "⬜️", "⬛️", "📦", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬜️", "⬛️", "⬛️", "⬛️",
                    "🟫", "🟫", "⬛️", "⬛️", "⬛️", "🟫", "🟫",
                    
                ]
            ),
            // LEVEL 2
            LevelModel(
                levelOffset: 7,
                levelDialogue: ContentComponent.CHAPTER2_LEVEL_DIALOGUE_2,
                levelMap: [
                    
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    //Onboarding
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "🗄️", "🔯", "🗄️", "⬜️", "⬛️",
                    "⬛️", "🗄️", "⬜️", "📦", "⬜️", "🗄️", "⬛️",
                    "⬛️", "⬜️", "🗄️", "⬜️", "🗄️", "⬜️", "⬛️",
                    "⬛️", "🗄️", "⬜️", "🗄️", "⬜️", "🗄️", "⬛️",
                    "⬛️", "⬜️", "🗄️", "⬜️", "🗄️", "⬜️", "⬛️",
                    "⬛️", "🗄️", "⬜️", "🗄️", "⬜️", "🗄️", "⬛️",
                    "⬛️", "⬜️", "🗄️", "🙋🏿", "🗄️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 3
            LevelModel(
                levelOffset: 9,
                levelDialogue: ContentComponent.CHAPTER2_LEVEL_DIALOGUE_3,
                levelMap: [
                    
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    //Onboarding
                    "🟫", "🟫", "🟫", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "🟫", "🟫", "⬛️", "⬛️", "🔯", "⬛️", "🔯", "⬜️", "⬛️",
                    "🟫", "⬛️", "⬛️", "⬜️", "📦", "⬜️", "📦", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "🗄️", "🙋🏿", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "⬛️", "🔯", "⬛️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "📦", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "🟫", "⬛️", "⬛️", "⬜️", "📦", "⬜️", "📦", "⬛️", "⬛️",
                    "🟫", "🟫", "⬛️", "⬜️", "🔯", "⬜️", "🔯", "⬛️", "🟫",
                    "🟫", "🟫", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫",
                    
                ]
            ),
            // LEVEL 4
            LevelModel(
                levelOffset: 9,
                levelDialogue: ContentComponent.CHAPTER2_LEVEL_DIALOGUE_4,
                levelMap: [
                    
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🗄️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🙋🏿", "🗄️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "🟫", "🟫", "🟫", "🟫", "🟫", "🟫", "🟫", "🟫", "🟫",
                    "🟫", "🟫", "🟫", "🟫", "🟫", "🟫", "🟫", "🟫", "🟫"
                    
                ]
            ),
            // LEVEL 5
            LevelModel(
                levelOffset: 9,
                levelDialogue: ContentComponent.CHAPTER2_LEVEL_DIALOGUE_5,
                levelMap: [
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "🗄️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "📦", "⬜️", "🗄️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "🗄️", "⬜️", "🗄️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "🗄️", "⬜️", "🗄️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "🗄️", "🙋🏿", "🗄️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "🗄️", "⬜️", "🗄️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "🗄️", "⬜️", "🗄️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "🗄️", "🗄️", "🗄️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "🗄️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "🗄️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 6
            LevelModel(
                levelOffset: 9,
                levelDialogue: ContentComponent.CHAPTER2_LEVEL_DIALOGUE_6,
                levelMap: [
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "🗄️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "🗄️", "⬛️", "⬜️", "🗄️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "🗄️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🙋🏿", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🗄️", "⬜️", "🗄️", "⬜️", "⬛️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "📦", "⬜️", "⬛️",
                    "⬛️", "⬜️", "🗄️", "⬜️", "⬛️", "⬜️", "🗄️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 7
            LevelModel(
                levelOffset: 9,
                levelDialogue: ContentComponent.CHAPTER2_LEVEL_DIALOGUE_7,
                levelMap: [
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "🔯", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "📦", "📦", "📦", "📦", "📦", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬜️", "⬜️", "🙋🏿", "⬜️", "⬜️", "⬛️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "🗄️", "🗄️", "🗄️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "🗄️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 8
            LevelModel(
                levelOffset: 15,
                levelDialogue: ContentComponent.CHAPTER2_LEVEL_DIALOGUE_8,
                levelMap: [
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️", "🟫",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "🟫",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬛️", "🟫",
                    "⬛️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "🟫",
                    "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️", "🟫",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🗄️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "🟫",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬛️", "🟫",
                    "⬛️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🙋🏿", "⬛️", "🟫",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫",
                    
                ]
            ),
            // LEVEL 9
            LevelModel(
                levelOffset: 10,
                levelDialogue: ContentComponent.CHAPTER2_LEVEL_DIALOGUE_9,
                levelMap: [
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "🟫", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬜️", "🗄️", "⬜️", "⬛️", "🗄️", "🗄️", "⬜️", "⬛️",
                    "⬛️", "🙋🏿", "📦", "⬜️", "📦", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬜️", "🗄️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "🟫", "⬛️", "🔯", "⬜️", "🔯", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "🟫", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 10
            LevelModel(
                levelOffset: 11,
                levelDialogue: ContentComponent.CHAPTER2_LEVEL_DIALOGUE_10,
                levelMap: [
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "🔯", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "📦", "🗄️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "🗄️", "🙋🏿", "🗄️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "📦", "🗄️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "🔯", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 11
            LevelModel(
                levelOffset: 9,
                levelDialogue: ContentComponent.CHAPTER2_LEVEL_DIALOGUE_11,
                levelMap: [
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "🔯", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "📦", "🗄️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "🗄️", "⬜️", "🗄️", "⬜️", "🗄️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "📦", "🗄️", "⬜️", "🗄️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "🗄️", "⬜️", "🙋🏿", "⬜️", "🗄️", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "🗄️", "⬜️", "🗄️", "📦", "⬜️", "⬛️",
                    "⬛️", "⬜️", "🗄️", "⬜️", "🗄️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "🗄️", "📦", "🗄️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "🔯", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 12
            LevelModel(
                levelOffset: 9,
                levelDialogue: ContentComponent.CHAPTER2_LEVEL_DIALOGUE_12,
                levelMap: [
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "🔯", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "📦", "🔯", "📦", "🔯", "📦", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "🗄️", "⬜️", "🗄️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "📦", "⬜️", "🗄️", "⬜️", "📦", "⬜️", "⬛️",
                    "⬛️", "⬜️", "🔯", "⬜️", "🙋🏿", "⬜️", "🔯", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 13
            LevelModel(
                levelOffset: 11,
                levelDialogue: ContentComponent.CHAPTER2_LEVEL_DIALOGUE_13,
                levelMap: [
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "🔯", "⬛️", "🔯", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬛️", "🔯", "⬜️", "🗄️", "⬜️", "📦", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬛️", "🔯", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬜️", "🗄️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬜️", "🗄️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬛️", "🔯", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬛️", "🔯", "⬜️", "🗄️", "⬜️", "📦", "⬜️", "🗄️", "⬛️",
                    "⬛️", "🔯", "⬛️", "🔯", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "🙋🏿", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 14
            LevelModel(
                levelOffset: 7,
                levelDialogue: ContentComponent.CHAPTER2_LEVEL_DIALOGUE_14,
                levelMap: [
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    
                    "🟫", "🟫", "⬛️", "⬛️", "⬛️", "⬛️", "🟫",
                    "🟫", "⬛️", "⬛️", "🔯", "🔯", "⬛️", "🟫",
                    "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "📦", "⬜️", "⬛️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬜️", "⬛️", "⬛️", "⬜️", "⬛️",
                    "🟫", "⬛️", "⬜️", "⬛️", "🙋🏿", "⬜️", "⬛️",
                    "🟫", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "🟫", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "🟫", "⬛️", "⬜️", "⬜️", "🗄️", "⬜️", "⬛️",
                    "🟫", "⬛️", "⬜️", "📦", "🗄️", "⬜️", "⬛️",
                    "🟫", "⬛️", "⬜️", "⬜️", "🗄️", "⬜️", "⬛️",
                    "🟫", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                    
                ]
            ),
            // LEVEL 15
            LevelModel(
                levelOffset: 13,
                levelDialogue: ContentComponent.CHAPTER2_LEVEL_DIALOGUE_15,
                levelMap: [
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "⬜️", "⬜️", "🗄️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬛️", "⬛️", "⬛️", "⬜️", "⬛️", "⬛️", "⬛️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🗄️", "⬜️", "⬜️", "⬜️", "⬜️", "🙋🏿", "⬜️", "⬜️", "⬜️", "⬜️", "🗄️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬛️", "⬛️", "⬛️", "⬜️", "⬛️", "⬛️", "⬛️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "⬜️", "⬜️", "🗄️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 16
            LevelModel(
                levelOffset: 13,
                levelDialogue: ContentComponent.CHAPTER2_LEVEL_DIALOGUE_16,
                levelMap: [
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🗄️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "📦", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬜️", "📦", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬜️", "⬜️", "📦", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "🔯", "⬜️", "🔯", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬜️", "⬜️", "📦", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬜️", "📦", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "📦", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🗄️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🗄️", "🙋🏿", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 17
            LevelModel(
                levelOffset: 13,
                levelDialogue: ContentComponent.CHAPTER2_LEVEL_DIALOGUE_17,
                levelMap: [
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬜️", "⬜️", "⬜️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "🗄️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "🗄️", "⬜️", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🙋🏿", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 18
            LevelModel(
                levelOffset: 11,
                levelDialogue: ContentComponent.CHAPTER2_LEVEL_DIALOGUE_18,
                levelMap: [
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "🔯", "⬜️", "🙋🏿", "⬜️", "🔯", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "🗄️", "🗄️", "🗄️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "🗄️", "⬜️", "⬜️", "⬜️", "🗄️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "⬜️", "🔯", "⬜️", "⬜️", "⬜️", "🔯", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 19
            LevelModel(
                levelOffset: 11,
                levelDialogue: ContentComponent.CHAPTER2_LEVEL_DIALOGUE_19,
                levelMap: [
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    
                    "🟫", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫", "🟫", "🟫",
                    "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬛️", "⬛️", "🟫",
                    "⬛️", "⬜️", "⬜️", "⬜️", "📦", "📦", "⬜️", "⬜️", "⬜️", "⬛️", "🟫",
                    "⬛️", "⬜️", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "📦", "⬜️", "🗄️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "🗄️", "🙋🏿", "🗄️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "🗄️", "⬜️", "🔯", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🔯", "⬜️", "⬜️", "⬛️",
                    "🟫", "⬛️", "⬜️", "⬜️", "⬜️", "🔯", "🔯", "⬜️", "⬜️", "⬜️", "⬛️",
                    "🟫", "⬛️", "⬛️", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "🟫", "🟫", "🟫", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 20
            LevelModel(
                levelOffset: 11,
                levelDialogue: ContentComponent.CHAPTER2_LEVEL_DIALOGUE_20,
                levelMap: [
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "🗄️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🗄️", "🔯", "🗄️", "⬜️", "⬜️", "⬜️", "⬜️", "🙋🏿", "⬜️", "⬛️",
                    "⬛️", "⬜️", "🗄️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "🗄️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "📦", "⬜️", "🗄️", "🔯", "🗄️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "📦", "⬜️", "⬜️", "🗄️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "📦", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🗄️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🗄️", "🔯", "🗄️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "🗄️", "⬜️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
            // LEVEL 21
            LevelModel(
                levelOffset: 11,
                levelDialogue: ContentComponent.CHAPTER2_LEVEL_DIALOGUE_21,
                levelMap: [
                    // ⬛️ = wall, 📦 = box,  🙋🏿 = person,  ⬜️ = grass,   🔯 = plate, 🗄️ = crate, 🕳️ = hole
                    
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "⬛️", "⬛️", "⬛️", "⬜️", "⬜️", "⬛️", "⬛️",
                    "⬛️", "⬜️", "🗄️", "⬜️", "🔯", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬛️",
                    "⬛️", "⬜️", "🗄️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "🙋🏿", "⬛️",
                    "⬛️", "⬜️", "🗄️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬛️",
                    "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "⬜️", "📦", "⬜️", "⬛️",
                    "⬛️", "⬜️", "🗄️", "⬜️", "🔯", "⬛️", "⬜️", "⬜️", "⬜️", "⬜️", "⬛️",
                    "⬛️", "🔯", "⬜️", "⬜️", "⬛️", "⬛️", "⬛️", "⬜️", "⬜️", "⬛️", "⬛️",
                    "⬛️", "⬛️", "⬛️", "⬛️", "⬛️", "🟫", "⬛️", "⬛️", "⬛️", "⬛️", "⬛️",
                    
                ]
            ),
        ]
    }
    
    
    
    static func getIndexes(of element: String, in array: [String]) -> [Int] {
        var result = [Int]()
        for (index, value) in array.enumerated() {
            if value == element {
                result.append(index)
            }
        }
        return result
    }
}
