Repository: ergdln/witchie
Catalog: witchie/witchie/Resources/*.lproj/Localizable.strings
Languages: es, fr, pt_br

# begin_game
source: Begin
es: Empezar
fr: Démarrer
pt_br: Começar

source: About us
es: Acerca de
fr: À propos
pt_br: Sobre nós

# wwdc2023_winner
source: Winning Game of the Swift Student Challenge 2023 🥇
es: Juego ganador del Swift Student Challenge 2023 🥇
fr: Jeu gagnant du Swift Student Challenge 2023 🥇
pt_br: Jogo vencedor do Swift Student Challenge 2023 🥇

source: Creator
es: Creador
fr: Créateur
pt_br: Criador

source: Game Designer
es: Diseñador de Juegos

source: Designer
es: Diseñadora

source: Level
es: Nivel
fr: Niveau
pt_br: Nıvel

source: Levels
es: Niveles
fr: Niveaux
pt_br: Nıveis

source: Back
es: atrás
fr: retour
pt_br: voltar

# jump
source: Skip
es: saltar
fr: sauter
pt_br: pular

source: chapters
es: capıtulos
fr: chapitres
pt_br: capítulos

# text_onboarding1
source: Hey, you there, let's cut to the chase 'cause I ain't got time for small talk. I'm Witchie.
es: Oye, tú ahı, vamos al grano porque no tengo tiempo para charlas. Soy Witchie.
fr: Hé, toi, soyons directs car je n'ai pas le temps pour les bavardages. Je suis Witchie
pt_br: Ei, você aı, vamos ser diretos porque tô sem tempo pra conversa fiada. Eu sou a Witchie.

# text_onboarding2
source: Somebody filled my lair with annoying spells, and they're sabotaging Vassorilda.
es: Alguien llenó mi guarida con hechizos molestos y están saboteando a Vassorilda.
fr: Quelqu'un a rempli mon antre de sorts agaçants et ils sabotent Vassorilda.
pt_br: Alguém encheu meu covil de feitiços irritantes e eles estão sabotando a Vassorilda.

# text_onboarding3
source: Fortunately, I'm quite clever and I know how to solve it: just place my cauldrons on top of the magical marks to neutralize them.
es: Afortunadamente, soy bastante astuta y sé cómo resolverlo: solo tienes que colocar mis calderos sobre las marcas mágicas para neutralizarlas.
fr: Heureusement, je suis très astucieuse et je sais comment résoudre ça : il suffit de placer mes chaudrons sur les marques magiques pour les neutraliser.
pt_br: Felizmente, sou muito esperta e sei como resolver: basta colocar meus caldeirões em cima das marcas mágicas para neutralizá-las.

# text_onboarding4
source: The issue is, with Vassorilda sabotaged, I can't move properly, so I need your help.
es: El problema es que, con Vassorilda saboteada, no puedo moverme correctamente, ası que necesito tu ayuda.
fr: Le problème, c'est qu'avec Vassorilda sabotée, je ne peux pas me déplacer correctement, donc j'ai besoin de ton aide.
pt_br: O problema é que, com a Vassorilda sabotada, eu não consigo me mover direito, por isso preciso da sua ajuda.

# text_onboarding5
source: So, are you ready for the challenge?
es: Entonces, ¿estás listo para el desafıo?
fr: Alors, es-tu prêt pour le défi?
pt_br: Eaı, pronto para o desafio?

# level_dialogue_1
source: Wow, look at how fast you are! I'm sure if you keep it up, Vassorilda will be back to normal in no time. Ready for the next room?
es: ¡Vaya, mira qué rápido eres! Estoy segura de que si sigues ası, Vassorilda volverá a la normalidad en poco tiempo. ¿Listo para la siguiente sala?
fr: Wow, regarde comme tu as été rapide! Je suis sûr que si tu continues comme ça, Vassorilda reviendra à la normale en un rien de temps. On passe à la prochaine salle?
pt_br: Caramba, olha como você foi rápido! Tenho certeza que, se continuar assim, a Vassorilda volta ao normal rapidinho. Vamo pra próxima sala?

# level_dialogue_2
source: Going up and down the staircase... I think the key is finding the patterns!
es: Subiendo y bajando la escalera... Creo que la clave está en encontrar los patrones.
fr: En montant et descendant l'escalier... Je pense que la clé est de trouver les motifs !
pt_br: Subindo e descendo a escadinha... Acho que encontrar os padrões é a chave!

# level_dialogue_3
source: Well... It wasn't as straightforward as before, but you didn't do too bad.
es: Bueno... No fue tan directo como antes, pero no lo hiciste tan mal.
fr: Eh bien... Ce n'était pas aussi simple que précédemment, mais tu t'en es pas trop mal sorti.
pt_br: É… Não foi tão direto quanto antes, mas até que você não foi mal.

# level_dialogue_4
source: See, all you had to do was stop and think instead of pushing everything at once! Haste makes waste, you know!
es: Ves, todo lo que tenıas que hacer era detenerte y pensar en lugar de empujar todo de una vez. ¡La prisa es mala consejera, ya sabes!
fr: Vois-tu, tout ce que tu avais à faire était de t'arrêter et de réfléchir au lieu de tout pousser en même temps! La hâte est mauvaise conseillère, tu sais!
pt_br: Viu que era só parar e pensar ao invés de empurrar tudo de uma vez? A pressa é inimiga da perfeição!

# level_dialogue_5
source: Seemed obvious, right? Well, there's the lesson to never trust anyone!!!
es: Parecıa obvio, ¿verdad? Bueno, aquı está la lección de nunca confiar en nadie!!!
fr: Ça semblait évident, n'est-ce pas? Eh bien, voilà la leçon à ne jamais faire confiance à personne!!!
pt_br: Parecia óbvio, né? Pois tá aı a lição de nunca confiar em ninguém!!!

# level_dialogue_6
source: It seems you forgot to stop and think again, huh? And it was even symmetric to make it easier.
es: Parece que olvidaste detenerte y pensar de nuevo, ¿eh? Y además, era simétrico para hacerlo más fácil.
fr: Il semble que tu aies encore oublié de t'arrêter et de réfléchir, hein? Et c'était même symétrique pour rendre les choses plus faciles.
pt_br: Esquecesse de parar e pensar de novo, né? E olhe que ainda tava tudo simétrico pra deixar mais fácil.

# level_dialogue_7
source: Wow, you take quite a while to listen to my hints...
es: Vaya, te tomas bastante tiempo para escuchar mis pistas...
fr: Wow, tu prends vraiment ton temps pour écouter mes indices...
pt_br: Eita como demora pra ouvir minhas dicas...

# level_dialogue_8
source: Look, don't put the blame on me, okay? My daughter was the one who kept insisting I called her architect boyfriend 'cause he had some 'modern' ideas for my rooms... What's wrong with the old and classic spiderweb, huh?!
es: Mira, no me eches la culpa a mı, ¿vale? Mi hija fue quien insistió en que llamara a su novio arquitecto porque tenıa algunas ideas 'modernas' para mis habitaciones... ¿Qué hay de malo en la vieja y clásica tela de araña, ¿eh?!
fr: Écoute, ne me rejette pas la faute, d'accord? C'était ma fille qui insistait pour que j'appelle son petit ami arcitecte parce qu'il avait des idées 'modernes' pour mes pièces... Qu'est-ce qui ne va pas avec la vieille et classique toile d'araignée, hein?!
pt_br: Olha, não vem jogar a culpa em mim não, viu! Minha filha que insistiu pra eu chamar o namorado arquiteto dela, porque ele tinha umas ideias “modernas” para as minhas salas… Qual o problema da velha e clássica teia de aranha?!?!

# level_dialogue_9
source: So you finally managed to get out of that room? It seems Vassorilda is starting to get back to normal. I think we can take a breather in the garden now!
es: ¿Verdad que finalmente lograste salir de esa habitación? Parece que Vassorilda está empezando a volver a la normalidad. Creo que ahora podemos tomar un respiro en el jardın.
fr: N'est-ce pas que tu as enfin réussi à sortir de cette pièce ? Il semble que Vassorilda commence à revenir à la normale, je pense que nous pouvons maintenant prendre une pause dans le jardin !
pt_br: Né que você finalmente conseguiu sair desse quarto? Parece que a Vassorilda tá começando a voltar ao normal, acho que agora podemos dar uma respirada no jardim!

# level_dialogue_10
source: This pattern was quite interesting, I think you should keep an eye on it...
es: Este patrón fue bastante interesante, creo que deberıas mantener un ojo en él...
fr: Ce motif était assez intéressant, je pense que tu devrais le surveiller...
pt_br: Esse padrão foi interessante, acho que vale a pena memorizar...

# level_dialogue_11
source: I'm starting to think they placed these circles in tricky spots intentionally...
es: Empiezo a pensar que colocaron estos cırculos en lugares complicados a propósito...
fr: Je commence à penser qu'ils ont intentionnellement placé ces cercles dans des endroits compliqués...
pt_br: Tô começando a achar que botaram esses cırculos em lugares complicadinhos de propósito...

# level_dialogue_12
source: Do you know what... Congratulations! This one was a game-changer. If you made it this far, maybe you've got a future in this line of work...
es: ¿Sabes qué... Felicidades! Este fue un punto de inflexión. Si has llegado hasta aquı, tal vez tengas un futuro en esta lınea de trabajo...
fr: Tu sais quoi... Félicitations! Celui-ci a tout changé. Si tu es arrivé jusque-là, peut-être as-tu un avenir dans ce domaine...
pt_br: Meus parabéns, viu? Essa aı era um divisor de águas. Se chegasse até aqui, talvez tenha algum futuro nesse trabalho…

# level_dialogue_13
source: I didn't even know that I had so many cauldrons, I think I'll do a garage sale.
es: Ni siquiera sabıa que tenıa tantos calderos, creo que haré una venta de garaje.
fr: Je ne savais même pas que j'avais autant de chaudrons, je pense que je vais faire une vente de garage.
pt_br: Eu nem sabia que eu tinha tanto caldeirão assim, acho que vou fazer um bazar.

# level_dialogue_14
source: Wow, so much running around, I'm even a little dizzy!
es: ¡Vaya, tanta carrera de un lado a otro, incluso me siento un poco mareada!
fr: Wow, tellement de va-et-vient, je suis même un peu étourdi(e)!
pt_br: Eita quanta correria pra lá e pra cá, chega tô tontinha!

# level_dialogue_15
source: Well... you're actually getting good at this. Two stars are better than one!
es: Bueno... te estás volviendo bueno en esto. ¡Dos estrellas son mejores que una!
fr: Eh bien... tu es en train de devenir bon à cela, deux étoiles valent mieux qu'une.
pt_br: É… você até tá ficando bom nisso, duas estrelas são melhores que uma!

# level_dialogue_16
source: Ok, this one was a breath of fresh air after so many intense rooms.
es: Vale, este fue un soplo de aire fresco después de tantas salas intensas.
fr: D'accord, celui-ci a été un souffle d'air frais après tant de salles intenses.
pt_br: Ok, essa foi um respiro de tranquilidade depois desses últimas salas tão intensas.

# level_dialogue_17
source: I spoke too soon...
es: Hablé demasiado pronto...
fr: J'ai parlé trop vite...
pt_br: Falei cedo demais.

# level_dialogue_18
source: How on earth do they fit so many cauldrons in just one room????
es: ¿Cómo diablos lograron meter tantos calderos en una sola habitación?
fr: Comment diable ont-ils réussi à caser autant de chaudrons dans une seule pièce????
pt_br: Como é que cabe tanto caldeirão numa sala só?????

# level_dialogue_19
source: Do these magic circles ever end? My back can't take it anymore.
es: ¿Estos cırculos mágicos alguna vez terminan? Mi espalda ya no puede más.
fr: Ces cercles magiques n'en finissent-ils jamais ? Mon dos n'en peut plus.
pt_br: Esses cırculos não acabam nunca? Minhas costas não aguentam mais.

# level_dialogue_20
source: I won't even blame you for the delay on this one. Actually, if you need a psychologist, I've got recommendations.
es: Ni siquiera te culparé por la demora en este. De hecho, si necesitas un psicólogo, tengo recomendaciones.
fr: Je ne vais même pas te blâmer pour le retard sur celui-ci. En fait, si tu as besoin d'un psychologue, j'ai des recommandations.
pt_br: Nessa daqui eu não vou nem te culpar pela demora. Inclusive, se precisar de um psicólogo tenho indicações.

# level_dialogue_21
source: I didn't expect much from you, but I was surprised. Maybe you're the best assistant I've ever had.
es: No esperaba mucho de ti, pero me sorprendiste. Tal vez seas el mejor asistente que he tenido.
fr: Je n'attendais pas grand-chose de toi, mais j'ai été surpris. Peut-être es-tu le meilleur assistant que j'aie jamais eu.
pt_br: Eu não dava nada por você mas fui surpreendido, talvez você seja o melhor ajudante que eu já tive.

# chapter2_entry_text1
source: Phew, after so many rooms tidied up, it's time to take a break. My sciatica can't take it anymore!
es: Uf, después de tantas habitaciones ordenadas, es hora de tomar un descanso. ¡Mi ciático ya no puede más!
fr: Ouf, après avoir rangé tant de pièces, il est temps de faire une pause. Mon sciatique ne supporte plus!
pt_br: Ufa, depois de tantas salas arrumadas, é hora de dar uma pausa. Meu ciático não aguenta mais!

# chapter2_entry_text2
source: Let's go to my garden! The air there is very fresh, and you'll love meeting my little plants. My favorite daughter is Gertrudes!
es: ¡Vamos a mi jardın! El aire allı es muy fresco, y te encantará conocer mis plantitas; mi hija favorita es Gertrudes.
fr: Allons dans mon jardin! L'air y est très frais, et tu vas adorer rencontrer mes petites plantes. Ma fille préférée est Gertrudes!
pt_br: Vamos para o meu jardim! O ar lá é muito fresco e você vai amar conhecer minhas plantinhas, a minha filha preferida é a Gertrudes!

# chapter2_entry_text3
source: Hold on... What happened here? All my pots are empty and scattered around... GERTRUDES, NOOOOOOO!
es: Espera... ¿Qué ha sucedido aquı? Todos mis vasos están vacıos y esparcidos por ahı... ¡GERTRUDES, NOOOOOOO!
fr: Attends... Qu'est-ce qui s'est passé ici? Tous mes pots sont vides et éparpillés... GERTRUDES, NOOOOOOOON!
pt_br: Pera.. O que aconteceu aqui? Todos os meus vasos estão vazios e espalhados por aı... GERTRUDES, NÃAAAAAAO

# chapter2_entry_text4
source: SCOUNDRELS! We need to take care of this now, nobody messes with my little ones!
es: ¡MALDITOS! Necesitamos ocuparnos de esto ahora, ¡nadie toca a mis bebés!
fr: MAUDITS! Nous devons nous occuper de ça maintenant, personne ne touche à mes petits!
pt_br: MALDITOS! Precisamos cuidar disso agora, ninguém mexe com meus nenens!

# chapter2_entry_text5
source: We have to put the pots in the magical soil for the plants to return to normal! Don't worry, we can use the bushes to move around better.
es: ¡Tenemos que poner los vasos en la tierra mágica para que las plantas vuelvan a la normalidad! No te preocupes, podemos usar los arbustos para movernos mejor.
fr: Nous devons mettre les pots dans la terre magique pour que les plantes retrouvent leur état normal ! Ne t'inquiète pas, nous pouvons utiliser les buissons costaud pour nous déplacer plus facilement.
pt_br: Temos que colocar os vasos na terra mágica para as plantas voltarem ao normal! Não se preocupe, podemos usar o arbusto robusto para nos movermos melhor.

# chapter2_level_dialogue_1
source: Did you understand how the bushes work? Just like you, they're not just for decoration.
es: ¿Entendiste cómo funcionan los arbustos? Al igual que tú, no son solo para decorar.
fr: Tu as compris comment fonctionnent les buissons? Tout comme toi, ils ne sont pas là que pour la décoration.
pt_br: Entendeu como funcionam os arbustos? Assim com você, eles não servem só para decoração.

# chapter2_level_dialogue_2
source: Ok, maybe I've exaggerated on the amount of bushes. Be careful not to lose yourself out there.
es: Está bien, quizás exageré con la cantidad de arbustos. Ten cuidado de no perderte por ahı.
fr: D'accord, peut-être que j'ai exagéré avec le nombre de buissons. Fais attention de ne pas te perdre là-bas.
pt_br: Ok, talvez eu tenha exagerado na quantidade de arbustos. Cuidado pra não se perder por aı.

# chapter2_level_dialogue_3
source: The scenery has changed, but some things never change. Not all moves are as straightforward as they seem; remember to think a bit more.
es: El escenario ha cambiado, pero algunas cosas nunca cambian. No todos los movimientos son tan simples como parecen; recuerda pensar un poco más.
fr: Le paysage a changé, mais certaines choses ne changent jamais. Tous les mouvements ne sont pas aussi simples qu'ils en ont l'air; rappelle-toi de réfléchir un peu plus.
pt_br: O cenário mudou, mas algumas coisas nunca mudam. Nem todas as jogadas são tão diretas ao ponto assim, lembre de pensar um pouco mais.

# chapter2_level_dialogue_4
source: You've forgotten everything you learned back at home, huh? Stay alert, you'll need it here too!
es: ¿Olvidaste todo lo que aprendiste en casa, eh? Mantente alerta, también lo necesitarás aquı.
fr: Tu as oublié tout ce que tu as appris chez toi, hein? Reste vigilant, tu en auras besoin ici aussi!
pt_br: Esqueceu de tudo que aprendeu lá em casa, né? Fique atento que aqui vai precisar também!

# chapter2_level_dialogue_5
source: This plant is the equivalent of a betta fish; it doesn't tolerate other plants, so it's quite solitary.
es: Esta planta es el equivalente a un pez betta; no tolera otras plantas, por lo que es bastante solitaria.
fr: Cette plante est l'équivalent d'un poisson combattant; elle ne tolère pas d'autres plantes, elle est donc assez solitaire.
pt_br: Essa planta é o equivalente à um peixe beta, ela não tolera outras plantas, por isso ela está solitária.

# chapter2_level_dialogue_6
source: Be careful when pushing the bushes; sometimes it hinders more than it helps.
es: Ten cuidado al empujar los arbustos; a veces más bien entorpece que ayuda.
fr: Fais attention lorsque tu pousses les buissons; parfois, cela gêne plus que cela n'aide.
pt_br: Toma cuidado na hora de empurrar os arbustos, às vezes atrapalha mais do que ajuda.

# chapter2_level_dialogue_7
source: You started well, but now you're slowing down. Is this a metaphor for life?
es: Comenzaste bien, pero ahora te estás desacelerando. ¿Es una metáfora de la vida?
fr: Tu as bien commencé, mais maintenant tu ralentis. Est-ce une métaphore de la vie?
pt_br: Você começou bem, mas agora tá desacelerando. Seria uma metáfora da vida?

# chapter2_level_dialogue_8
source: My plants were eager to meet you, but apparently, your performance in the previous chapter gave us false hope. What a shame.
es: Mis plantas estaban ansiosas por conocerte, pero al parecer, tu desempeño en el capıtulo anterior nos dio falsas esperanzas. Qué lástima.
fr: Mes plantes étaient impatientes de te rencontrer, mais apparemment ta performance dans le chapitre précédent nous a donné de faux espoirs. Quel dommage.
pt_br: Minhas plantas estavam ansiosas pra te conhecer, mas aparentemente sua performance no capıtulo anterior nos deu falsas esperanças. Uma pena.

# chapter2_level_dialogue_9
source: A garden within a garden, maybe I was inspired by a famous movie... Do you know which one, or are you just another uncultured soul?
es: Un jardın dentro de otro jardın, tal vez me inspiré en una pelıcula famosa... ¿Sabes cuál es o eres simplemente otra alma inculta?
fr: Un jardin dans un jardin, peut-être ai-je été inspiré par un film célèbre... Tu sais lequel, ou es-tu juste une âme inculte de plus?
pt_br: Um jardim dentro de um jardim, talvez eu tenha me inspirado em um filme famoso... Sabe qual é ou você só é mais um sem cultura?

# chapter2_level_dialogue_10
source: You started off surrounded, didn't you? Get used to it; life's like that
es: Comenzaste rodeado, ¿verdad? Acostúmbrate; la vida es ası.
fr: Tu as commencé entouré, n'est-ce pas? Habitue-toi à ça; la vie est ainsi.
pt_br: Começou cercado, né? Se acostuma que a vida é assim!

# chapter2_level_dialogue_11
source: If you keep pushing without thinking, you'll never get through the levels quickly...
es: Si sigues empujando sin pensar, nunca avanzarás rápidamente de niveles...
fr: Si tu continues à pousser sans réfléchir, tu ne passeras jamais rapidement les niveaux...
pt_br: Se tu só ficar empurrando sem pensar, nunca vai conseguir passar logo das fases...

# chapter2_level_dialogue_12
source: Pushing to one side, pushing to the other... nothing new under the sun!
es: Empuja hacia un lado, empuja hacia el otro... nada nuevo bajo el sol.
fr: Pousse d'un côté, pousse de l'autre... rien de nouveau sous le soleil!
pt_br: Empurra pra um lado, empurra pro outro... nada de novo sob o sol!

# chapter2_level_dialogue_13
source: My gardens are filled with beautiful corridors, lucky you to have the honor of working in them!
es: Mis jardines están llenos de hermosos corredores, tienes suerte de tener el honor de trabajar en ellos.
fr: Mes jardins sont remplis de magnifiques corridors, tu as de la chance d'avoir l'honneur de travailler dedans!
pt_br: Meus jardins são cheios de belos corredores, olha que sorte a sua ter a honra de trabalhar neles!

# chapter2_level_dialogue_14
source: Just like us witches, the best plants bloom under pressure.
es: Ası como nosotras, las brujas, las mejores plantas florecen bajo presión.
fr: Tout comme nous les sorcières, les meilleures plantes fleurissent sous pression.
pt_br: Assim como nós bruxas, as melhores plantas florescem sob pressão.

# chapter2_level_dialogue_15
source: This is one of my favorite gardens. It's large and majestic, quite unlike certain individuals...
es: Este es uno de mis jardines favoritos. Es grande y majestuoso, bastante diferente a ciertas personas...
fr: C'est l'un de mes jardins préférés. Il est grand et majestueux, tout à fait contrairement à certaines personnes...
pt_br: Esse é um dos meus jardins favoritos. Ele é grande e majestososo, bem diferente de certas pessoas...

# chapter2_level_dialogue_16
source: I created this garden as a tribute to a game I loved in my childhood. I miss being a kid, there were no bills to pay...
es: Creé este jardın en homenaje a un juego que amaba en mi infancia. Extraño ser un niño; no habıa facturas que pagar...
fr: J'ai créé ce jardin en hommage à un jeu que j'aimais dans mon enfance. Tu me manques d'être enfant; il n'y avait pas de factures à payer...
pt_br: Eu fiz esse jardim em homenagem à um jogo que eu adorava na infância. Saudade de ser criança, não existiam boletos pra pagar..

# chapter2_level_dialogue_17
source: The plants are sprouting like magic beans! Perhaps you can learn a thing or two from them as well.
es: Las plantas están brotando como si fueran habichuelas mágicas. Tal vez puedas aprender una o dos cosas de ellas también.
fr: Les plantes poussent comme des haricots magiques! Peut-être que tu peux aussi en apprendre une ou deux choses d'elles.
pt_br: As plantas estão brotando como se fossem feijões mágicos! Talvez você também possa aprender uma coisa ou duas com elas.

# chapter2_level_dialogue_18
source: I've noticed you're pushing those bushes as if they were your dreams: forcefully, but without hope.
es: He notado que estás empujando esos arbustos como si fueran tus sueños: con fuerza, pero sin esperanza.
fr: J'ai remarqué que tu pousses ces buissons comme s'ils étaient tes rêves: avec force, mais sans espoir.
pt_br: Notei que você está empurrando esses arbustos como se eles fossem seus sonhos: com força, mas sem esperança.

# chapter2_level_dialogue_19
source: Even pumpkins turn into carriages more easily than you place the plants in position.
es: Incluso las calabazas se convierten en carruajes más fácilmente que como colocas las plantas en posición.
fr: Même les citrouilles se transforment plus facilement en carrosses que tu ne mets en place les plantes.
pt_br: Até as abóboras se transformam em carruagens com mais facilidade do que você coloca as plantas no lugar.

# chapter2_level_dialogue_20
source: WE FINALLY FOUND GERTRUDE!!! I had to create a special garden for my special little plant.
es: ¡FINALMENTE ENCONTRAMOS A GERTRUDES! Tuve que crear un jardın especial para mi pequeña planta especial.
fr: NOUS AVONS ENFIN TROUVÉ GERTRUDE!!! J'ai dû créer un jardin spécial pour ma petite plante spéciale.
pt_br: FINALMENTE ENCONTRAMOS A GERTRUDES!!! Tive que fazer um jardim especial para minha plantinha especial.
