Repository: ergdln/witchie
Catalog: witchie/witchie/Resources/*.lproj/Localizable.strings
Languages: es, fr, pt_br

# chapter2_level_dialogue_21
source: The garden is finally in bloom again, and Gertrude looks more beautiful than ever! And we managed to finish just in time for the most special time of the year...
es: El jardın finalmente está floreciendo de nuevo, y Gertrudes se ve más hermosa que nunca. Y logramos terminar justo a tiempo para la época más especial del año...
fr: Le jardin est enfin en fleurs à nouveau, et Gertrude est plus belle que jamais! Et nous avons réussi à terminer juste à temps pour le moment le plus spécial de l'année...
pt_br: Finalmente o jardim está florido novamente, e a Gertrudes está mais linda do que nunca! E conseguimos terminar logo antes da época mais especial do ano...

source: Dev
fr: Dév
